<?php
// Предопределенная константа для имени текущего скрипта
echo "Имя текущего скрипта: " . $_SERVER['SCRIPT_NAME'] . "<br>";

// Переменная для хранения имени пользователя
$username = "Роман";

// Вывод приветствия с использованием переменной
echo "Привет, $username! <br>";

// Предопределенная константа для версии PHP
echo "Версия PHP: " . PHP_VERSION . "<br>";

// Переменная для хранения числа
$number = 69;

// Вывод числа с использованием переменной
echo "Число: $number <br>";
?>
